examples/sockets/OpenFOAM/OpenFOAM-3.0.1/cpl-socket/tests/stressC-P/test_forces_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    CPLReceiveMD 
    {
        type            fixedValue;
        value           uniform (5 0 0);
    }

    streamwiseIn
    {
        type            cyclic; 
        neighbourPatch  streamwiseOut;
    }

    streamwiseOut
    {
        type            cyclic; 
        neighbourPatch  streamwiseIn;
    }

    front
    {
        type            cyclic;
        neighbourPatch  back;
    }

    back 
    {
        type            cyclic;
        neighbourPatch  front;
    }
}

// ************************************************************************* //
